src/main/resources/xml/accommodationSalesServicePort/retrievePackageAndRackRates/retrievePackageAndRackRates.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://sales.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <sal:retrievePackageAndRackRates>
         <request>
            <accomComponentId>?</accomComponentId>
            <packageCode>?</packageCode>
            <partyMix>
               <!--Zero or more repetitions:-->
               <agesOfChildren>
                  <age>?</age>
                  <!--Optional:-->
                  <adultFlag>?</adultFlag>
               </agesOfChildren>
               <!--Optional:-->
               <selectedLineNumber>?</selectedLineNumber>
               <numberOfAdults>?</numberOfAdults>
               <numberOfChildren>?</numberOfChildren>
            </partyMix>
            <resortCode>?</resortCode>
            <resortPeriod>
               <!--Optional:-->
               <endDate>?</endDate>
               <!--Optional:-->
               <startDate>?</startDate>
            </resortPeriod>
            <roomTypeTO>
               <!--Optional:-->
               <accommodationFacilityTO>
                  <DVCProperty>?</DVCProperty>
                  <dmeSupported>?</dmeSupported>
                  <goodNeighborProperty>?</goodNeighborProperty>
                  <hotelPlazaProperty>?</hotelPlazaProperty>
                  <!--Optional:-->
                  <resortCode>?</resortCode>
                  <!--Optional:-->
                  <resortName>?</resortName>
               </accommodationFacilityTO>
               <concierge>?</concierge>
               <!--Optional:-->
               <roomTypeCode>?</roomTypeCode>
               <!--Optional:-->
               <roomTypeName>?</roomTypeName>
            </roomTypeTO>
            <travelPlanSegmentId>?</travelPlanSegmentId>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </sal:retrievePackageAndRackRates>
   </soapenv:Body>
</soapenv:Envelope>
